#+TITLE: Configuracion de emacs.


* Informacion personal
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Rafael Leyva Ruiz"
	user-mail-address "rafaelleru95103@gmail.com"
	user-mail-address-2-2 "rafaelleru95103@correo.ugr.es"
	calendar-latitude 42.2
	calendar-longitude -71.1
	calendar-location-name "Madrid, ES")
#+END_SRC

#+RESULTS:
: Madrid, ES

* evil-leader
   #+BEGIN_SRC emacs-lisp
     (use-package evil-leader
       :ensure t
       :config
       (evil-leader/set-leader "<SPC>")
       (evil-leader/set-key
	 "<SPC>" 'helm-M-x

	 ;; Window management
	 "wo" 'other-window
	 "wh" 'evil-window-left
	 "wl" 'evil-window-right
	 "wj" 'evil-window-down
	 "wk" 'evil-window-up
	 "wd" 'delete-window
	 "w\"" 'split-window-vertically
	 "wO"  'delete-other-windows
	 "w%" 'split-window-horizontally
	 "wM" 'delete-other-windows
	 "wF" 'make-frame

	 ;; projectile
	 "pp" 'projectile-switch-project
	 "pb" 'projectile-switch-to-buffer
	 "pf" 'helm-projectile-find-file
	 "pc" 'helm-projectile-compile-project
	 "ph" 'helm-projectile
	 "pu" 'helm-projectile-run-project
	 "pt" 'projectile-regenerate-tags


	 "bb" 'helm-mini
	 "bd" 'kill-this-buffer
	 "B" 'ibuffer

	 "gg" 'magit-status
	 "gc" 'magit-checkout

	 "y" 'helm-show-kill-ring
	 "nt" 'neotree-toggle
	 "ff" 'helm-find-files
	 ":" 'eval-expression
	 "/" 'swiper-helm
	 )
       )
     (evil-leader/set-key-for-mode 'python-mode ",g" 'elpy-goto-definition)
   #+END_SRC

   #+RESULTS:
<<<<<<< HEAD
=======
   : t
>>>>>>> origin/master

** Modo terminal
   #+BEGIN_SRC emacs-lisp :tangle no
   (add-hook 'term-mode-hook '(set-background-color white))
   #+END_SRC

   #+RESULTS:
   | set-background-color | white |

** powerline
   #+BEGIN_SRC emacs-lisp
     (setq powerline-arrow-left 1)
   #+END_SRC

   #+RESULTS:
   : 1

* elfeed
  #+BEGIN_SRC emacs-lisp :tangle no
    (use-package elfeed
      :ensure t
      :init
      :config
    )
    (setq elfeed-db-directory "~/.emacs.d/elfeeddb")
  #+END_SRC

  #+RESULTS:
  : ~/.emacs.d/elfeeddb

  #+BEGIN_SRC emacs-lisp :tangle no
    (use-package elfeed-goodies
    :ensure t
    :config
    )
    (elfeed-goodies/setup)
  #+END_SRC

  #+RESULTS:
  : elfeed-goodies/split-show-prev

  #+BEGIN_SRC emacs-lisp :tangle no
    (use-package elfeed-org
      :ensure t
      )
    (elfeed-org)
    (setq rmh-elfeed-org-files (list "/data/Nextcloud/org/rss.org"))
  #+END_SRC

  #+RESULTS:
  | /data/Nextcloud/org/rss.org |

** Autocomplete mode.
   #+BEGIN_SRC emacs-lisp :tangle no
     (use-package auto-complete
       :ensure t
       :config
       (ac-config-default)
       )

     ;; (add-hook 'org-mode-hook 'auto-complete-mode)
     ;; (add-hook 'emacs-lisp-mode-hook 'auto-complete-mode)
   #+END_SRC

   #+RESULTS:
   | auto-complete-mode | ac-emacs-lisp-mode-setup |

*** autocomplete C/C++ headers from .h files in a project
    #+BEGIN_SRC emacs-lisp :tangle no
      (use-package auto-complete-c-headers
	:ensure t
	:config
	(defun my:ac-c-headers-init ()
	  (require 'auto-complete-c-headers)
	  (add-to-list 'ac-sources 'ac-source-c-headers)))

      (add-hook 'c++-mode-hook 'my:ac-c-headers-init)
      (add-hook 'c-mode-hook 'my:ac-c-headers-init)
    #+END_SRC

    #+RESULTS:
    | my:ac-c-headers-init | (lambda nil (easy-menu-add-item nil (quote (C)) (rtags-submenu-list))) | er/add-cc-mode-expansions | rtags-start-process-unless-running | irony-mode |

**** flycheck rtags integration
      #+BEGIN_SRC emacs-lisp
	(use-package flycheck-rtags
	  :ensure t
	  :config
	  (defun my-flycheck-rtags-setup ()
	    (flycheck-select-checker 'rtags)
	    (setq-local flycheck-highlighting-mode 'symbols)
	    (setq-local flycheck-check-syntax-automatically nil))
	  )

	;(add-hook 'c-mode-common-hook #'my-flycheck-rtags-setup)
	(add-hook 'irony-mode-hook 'my-flycheck-rtags-setup)
      #+END_SRC

      #+RESULTS:
      | my-flycheck-rtags-setup | my-irony-mode-hook | irony-cdb-autosetup-compile-options |

** PHP
   #+BEGIN_SRC emacs-lisp
     (flycheck-define-checker my-php
       "A PHP syntax checker using the PHP command line interpreter.

	See URL `http://php.net/manual/en/features.commandline.php'."
       :command ("php" "-l" "-d" "error_reporting=E_ALL" "-d" "display_errors=1"
		 "-d" "log_errors=0" source)
       :error-patterns
       ((error line-start (or "Parse" "Fatal" "syntax") " error" (any ":" ",") " "
	       (message) " in " (file-name) " on line " line line-end))
       :modes (php-mode php+-mode web-mode))

     (defun my/php-mode ()
       (flycheck-select-checker 'my-php)
       )

     (add-hook 'php-mode-hook 'my/php-mode)

     (add-hook 'php-mode-hook
	       '(lambda ()
		  (auto-complete-mode t)
		  (require 'ac-php)
		  (setq ac-sources  '(ac-source-php ) )
		  (yas-global-mode 1)
		  (ac-php-core-eldoc-setup ) ;; enable eldoc

		  (define-key php-mode-map  (kbd "C-]") 'ac-php-find-symbol-at-point)   ;goto define
		  (define-key php-mode-map  (kbd "C-t") 'ac-php-location-stack-back)    ;go back
		  ))


     (add-hook 'php-mode-hook
	       '(lambda ()
		  (require 'company-php)
		  (company-mode t)
		  (ac-php-core-eldoc-setup) ;; enable eldoc
		  (make-local-variable 'company-backends)
		  (add-to-list 'company-backends 'company-ac-php-backend)))
   #+END_SRC

   #+RESULTS:
   | (lambda nil (auto-complete-mode t) (require (quote ac-php)) (setq ac-sources (quote (ac-source-php))) (yas-global-mode 1) (ac-php-core-eldoc-setup) (define-key php-mode-map (kbd C-]) (quote ac-php-find-symbol-at-point)) (define-key php-mode-map (kbd C-t) (quote ac-php-location-stack-back))) | (lambda nil (require (quote company-php)) (company-mode t) (ac-php-core-eldoc-setup) (make-local-variable (quote company-backends)) (add-to-list (quote company-backends) (quote company-ac-php-backend))) | my/php-mode |

** Autorevertmode en buffers de rogmode
   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook 'auto-revert-mode 1)
   #+END_SRC

   #+RESULTS:
   | (lambda nil (org-bullets-mode t)) | auto-complete-mode | er/add-org-mode-expansions | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ac/setup-current-buffer | auto-revert-mode |

** Hacer que org no tenga scroll lateral.
   #+BEGIN_SRC emacs-lisp
     (add-hook 'org-mode-hook 'visual-line-mode)
   #+END_SRC

   #+RESULTS:
   | visual-line-mode | (lambda nil (org-bullets-mode t)) | auto-complete-mode | er/add-org-mode-expansions | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | org-ac/setup-current-buffer | auto-revert-mode |

** En vez de puntos suspensivos mostrar flecha '⤵'
   #+BEGIN_SRC emacs-lisp :tangle no
     (setq org-ellipsis "⤵")
   #+END_SRC

   #+RESULTS:
   : ⤵

*** Keywords TODO
    #+BEGIN_SRC emacs-lisp
      (setq org-todo-keywords '((sequence "TODO" "DOING" "WAITING" "|" "DONE")))
    #+END_SRC

    #+RESULTS:
    | sequence | TODO | DOING | WAITING |   |   | DONE |

*** Todos los archivos org los guardo en '~/org/'
     #+BEGIN_SRC emacs-lisp
       (setq org-directory "~/org")
     #+END_SRC

     #+RESULTS:
     : ~/org

*** Localizacion del archivo de todos
   #+BEGIN_SRC emacs-lisp
     (setq org-index-file (org-file-path "index.org"))
     (setq org-links-file (org-file-path "to-read.org"))
   #+END_SRC

   #+RESULTS:
   : ~/org/to-read.org

*** Localizacion del archive.org, ahi se guarda todo lo que hago.
   #+BEGIN_SRC emacs-lisp
     (setq org-archive-location
   	(concat (org-file-path "archive.org") "::* From %s"))
   #+END_SRC

   #+RESULTS:
   : ~/org/archive.org::* From %s

*** La agenda se carga desde el index
   #+BEGIN_SRC emacs-lisp
     (setq org-agenda-files (list org-index-file
   			       "~/org/gcal.org"
   			       "~/org/idea.org"))
   #+END_SRC

   #+RESULTS:
   | ~/org/index.org | ~/org/gcal.org | ~/org/idea.org |

**** TODO completar descripcion de los templates.
    #+BEGIN_SRC emacs-lisp
      (setq org-capture-templates
      '(("i" "Idea"
         entry
         (file (org-file-path "idea.org")
                 "* IDEA %?\n"))

        ("r" "To read item"
         checkitem
         (file+datetree (org-file-path "to-read.org"))
         " [ ] %? %^g")

        ("b" "Item to buy"
         entry
         (file+datetree "buylist.org")
         "* BUY %?")

         ("t" "Todo"
              entry
              (file+headline org-index-file "TASKS")
              "* TODO %?\n  ADDED:%T")

         ("u" "UGR Todo"
              entry
              (file+headline org-index-file "UGR")
              "* TODO %? %^g:UGR:\nADDED:%T")

         ("e" "Nuevo evento"
              entry
              (file "~/org/gcal.org")
          "* %?\n\n%^T\n\n:PROPERTIES:\n\n:END:\n\n")
         ))
     #+END_SRC

	  #+RESULTS:
	  | i | Idea | entry | (file (org-file-path idea.org) * IDEA %? |

*** Frame para capturas. :tangle no
    De [[https://github.com/zamansky/using-emacs/blob/master/myinit.org][Zamansky]]
    #+BEGIN_SRC emacs-lisp :tangle no
      (defadvice org-capture-finalize
      (after delete-capture-frame activate)
	"Advise capture-finalize to close the frame"
	(if (equal "capture" (frame-parameter nil 'name))
	(delete-frame)))

      (defadvice org-capture-destroy
      (after delete-capture-frame activate)
	"Advise capture-destroy to close the frame"
	(if (equal "capture" (frame-parameter nil 'name))
	(delete-frame)))

      ;; (use-package noflet
      ;;   :ensure t)

      ;; (defun make-cap
	  ture-frame ()
	"Create a new frame and run org-capture."
	(interactive)
	(make-frame '((name . "Capture")))
	(select-frame-by-name "Capture")
	(noflet ((switch-to-buffer-other-window (buf) (switch-to-buffer buf)))
      (delete-other-windows)
      (delete-other-frames)
      (org-capture)))

      (add-hook 'org-capture-mode-hook 'delete-other-windows)
      (add-hook 'org-capture-after-finalize-hook 'delete-frame)
    #+END_SRC

    #+RESULTS:
    | delete-frame |

    ;; TODO: fix delete-other-windows
    #+RESULTS:
    : make-capture-frame

**** hooks para la agenda:
     #+BEGIN_SRC emacs-lisp :tangle no
       ;(add-hook 'after-init-hook (lambda () (org-gcal-sync) ))
       (add-hook 'org-agenda-mode-hook (lambda () (org-gcal-sync) ))
       (add-hook 'org-capture-after-finalize-hook (lambda () (org-gcal-sync) ))
     #+END_SRC

     #+RESULTS:
     | (lambda nil (org-gcal-sync)) | delete-frame |

*** Exportar a PDF
Activar el coloreado de codigo con pylint
   #+BEGIN_SRC emacs-lisp
     (setq org-latex-pdf-process
   	'("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
             "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
             "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
   #+END_SRC

   #+RESULTS:
   | pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f | pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f | pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f |

Ademas incluimos este paquete en todos los documetos de latex que exportemos
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'org-latex-packages-alist '("" "minted"))
     (setq org-latex-listings 'minted)
   #+END_SRC

   #+RESULTS:
   : minted

** funcion para actualizar el indice de cosas que leer en el navegador
   #+BEGIN_SRC emacs-lisp
     ;; Auto-export org files to html when saved
     (defun org-mode-export-hook()
       "Auto export html"
       (when (eq major-mode 'org-mode)
         (when (equal buffer-file-name "/home/rafa/org/to-read.org")
          (org-twbs-export-to-html t))))

     (add-hook 'after-save-hook 'org-mode-export-hook)
   #+END_SRC

   #+RESULTS:
   | org-mode-export-hook |

** salir de small-shell y matar el buffer
   como solo la uso para cosas brebes no me interesa tener abiertas 2000000 instancias de small-shells
   #+BEGIN_SRC emacs-lisp :tangle no
     (add-hook 'eshell-hook (lambda ()
            		  (local-set-key (kbd "C-x C-k p")
         				 (delete-window)
            				 )))
   #+END_SRC

   #+RESULTS:
   | lambda | nil | (local-set-key (kbd C-x C-k p) (delete-window)) |

* Desactivo las flechas para no usarlas, que para algo tiene emacs tantos atajos
  #+BEGIN_SRC emacs-lisp
    (defun disable-arrow-keys ()
    (interactive)
	;;;Desactiva la nevagacion con las flechas
    (global-unset-key (kbd "<left>"))
    (global-unset-key (kbd "<right>"))
    (global-unset-key (kbd "<up>"))
    (global-unset-key (kbd "<down>")))


    (defun enable-arrow-keys ()
    (interactive)
	;;;Activa la navegacion con flecha
     (global-set-key (kbd "<left>") 'left-char)
     (global-set-key (kbd "<right>")  'right-char)
     (global-set-key (kbd "<up>") 'previous-line)
     (global-set-key (kbd "<down>") 'next-line))

    ;(disable-arrow-keys) He conseguido no usar las flechas al fin
  #+END_SRC

  #+RESULTS:
  : enable-arrow-keys

  #+BEGIN_SRC emacs-lisp
    (add-hook 'term-mode-hook
  	    (lambda ()
  	      (local-set-key (kbd "C-c C-k") 'kill-buffer-this-buffer)))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (local-set-key (kbd C-c C-k) (quote kill-buffer-this-buffer)) |

